{"_path":"/","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"Sobre mi","description":"Un tema de blog de código abierto desarrollado por Nuxt.","layout":"default","head":{"title":"Ernesto Aguaysol"},"body":{"type":"root","children":[{"type":"element","tag":"hero","props":{"image":"/alpine-1.webp"},"children":[{"type":"element","tag":"template","props":{"v-slot:title":""},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Hola, soy Ernesto Aguaysol."}]}]},{"type":"element","tag":"template","props":{"v-slot:description":""},"children":[{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Developer Nodejs Full Stack"}]}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Como desarrollador de Node.js con cinco años de experiencia en el ámbito de las aplicaciones web, tanto en el backend como en el frontend, he tenido la oportunidad de trabajar con una amplia variedad de tecnologías. A lo largo de mi trayectoria, he utilizado herramientas como Vue.js, NestJS, ExpressJS, MongoDB y PostgreSQL, entre otras. Una de mis filosofías de trabajo es dockerizar todo lo posible, lo que me permite mantener un entorno de desarrollo limpio y consistente. Además, prefiero trabajar en sistemas operativos basados en Linux, con una predilección por aquellos derivados de Debian, debido a su estabilidad y robustez."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Además de mi pasión por el desarrollo web, también me interesa profundamente el campo de la inteligencia artificial. Me encanta explorar desde los algoritmos tradicionales de machine learning hasta las redes neuronales artificiales, áreas que están en constante evolución y que presentan desafíos y oportunidades fascinantes. La IA no solo representa una herramienta poderosa para resolver problemas complejos, sino también un campo en el que las posibilidades parecen infinitas a medida que la tecnología avanza día a día."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En mi tiempo libre, disfruto de la impresión 3D, una actividad que considero un complemento perfecto para mis futuros proyectos en IoT y robótica. La capacidad de crear objetos físicos personalizados me permite materializar ideas y prototipos que podrían integrar inteligencia artificial y componentes robóticos. La impresión 3D no solo es un hobby, sino también una extensión natural de mis intereses en la tecnología y la innovación, permitiéndome experimentar y crear soluciones innovadoras para problemas del mundo real."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:1.index.md","_source":"content","_file":"1.index.md","_stem":"1.index","_extension":"md"}